Simple Linear Regression
 1. Relationship between two variables
 2. kati relation xa tesko base ma basera prediction garni
 3. equation 
     
    * y=a+bx
     a=constant/intercept
     b=function/slope of x.
     linear mean straight line in bidemnsional plot
     
     * how line is fitting
      
     * 2 variables and both numeric only.
     * for e.g X=food, y=weight
     * where does the line exist and that line has angle also.

In [1]:
# Regression in scikit-learn

Regression in scikit-learn

In [2]:
#steps involved:

In [2]:
#step 1:
#import libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

#other resources
from sklearn.model_selection import train_test_split
#befor importing regression and all those must import train test split
from sklearn.linear_model import LinearRegression

In [3]:
# step 2:
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
# assumptions in simple linear regression
# must have 2 variable and both should be numeric.
# here age and fare are both numeric.

#step3:
# question: how to select multiple columns.
df_linear=df[['age','fare']]

#differentiate X and y 
X=df[['age']]
#always put feature in 2-d not in 1-d otherwise it will go on series.
y=df['fare']

In [33]:
df_linear

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [12]:
#check null values 
X.isnull().sum()/len(X)*100

age    19.86532
dtype: float64

In [21]:
y.isnull().sum()/len(y)*100

0.0

In [5]:
# fill missing values in X.
df_linear.age.fillna(value=df_linear['age'].mean(),inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_18400\2129444139.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_linear.age.fillna(value=df_linear['age'].mean(),inplace=True)

In [23]:
X.isnull().sum()/len(X)*100

age    0.0
dtype: float64

In [6]:
# hanldling missing values is a way to have the same shape of x and y.
df_linear.isnull().sum()

age     0
fare    0
dtype: int64

In [25]:
X.shape

(891, 1)

In [26]:
y.shape
#here y is series.

(891,)

In [11]:
sns.boxplot(data=df_linear)